namespace task19;
class Program
// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да
{
    static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}


// PrintS(" Input number from 10000 to 99999: ");
// var arrayNumber = Console.ReadLine().ToArray();
// if (arrayNumber.Length != 5) {
//     PrintSL("Error");
// }
// else {if (arrayNumber[0] == arrayNumber[4] && arrayNumber[1] == arrayNumber[3]) {
//         PrintSL("ok");
//     }
//     else {PrintSL("Nope");}
// }

